{
  "menu": {
    "home": "Home",
    "about": "About Me",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "name": "Hi! I'm Brayan",
    "description": "Passionate about creating captivating digital experiences, I transform concepts into attractive and highly intuitive interfaces, always with a focus on usability and user satisfaction.",
    "sliderText": "Transforming ideas into code ,and code into solutions.",
    "aboutMeTitle": "About Me",
    "aboutMeSubTitle": "More",
    "projectsTitle": "Projects",
    "projectsSubTitle": "My",
    "contact": "Get in touch",
    "TechStack": "Tech Stack",
    "experience": "Years Experience",
    "totalProjects": "Total Projects",
    "responsiveApps": "Responsive Apps",
    "worktogether": "Let's work",
    "together": "Together",
    "downloadButton": "Download CV"
  },
  "about": {
    "title": "ABOUT ME",
    "description": "Frontend developer with a solid track record in creating responsive and pixel-perfect web interfaces. Proficient in HTML, CSS, JavaScript, React and Next.js, with experience in real-time communication, database management and secure payment integration. Continuously learning and adapting to the latest technologies.",
    "experience": "EXPRIENCE",
    "education": "EDUCATION"
  },
  "experience1": {
    "year": "06/2024 - Present",
    "job": "Frontend Developer - Pun Game (NFTs)",
    "detail": "Remote",

    "description1": "Developed a web application from scratch using Next.js, WebSocket, WalletConnect, and Postgres as the core technology stack.",
    "description2": "Achieved a responsive integration that allows users to seamlessly connect from different devices, create lobbies, and join friends using a lobby code to start the game.",
    "description3": "Designed the game mechanics around drawing and guessing words, integrating WebSocket to ensure real-time communication, manage the drawing board, timer, and game rounds.",
    "description4": "Implemented backend solutions to handle HTTP requests, manage global user scores, and display them in a real-time leaderboard."
  },
  "experience2": {
    "year": "04/2024 - Present",
    "job": "Frontend Developer - Own Crowdfunding Project",
    "detail": "Remote",

    "description1": "Developed an interactive and dynamic user interface using React.js, Express, and Firebase as the core technology stack, achieving a responsive and pixel-perfect user experience.",
    "description2": "Implemented Firebase to manage a real-time database, user authentication, and file storage, configuring security rules and optimizing queries for better performance.",
    "description3": "Integrated a secure payment gateway that allows users to contribute to crowdfunding projects, utilizing well-known payment APIs to process transactions safely and efficiently.",
    "description4": "Ensured that each component of the application functions smoothly and consistently across all devices, guaranteeing both security and efficiency in user operations."
  },
  "projects": {
    "title": "ALL PROJECTS",
    "website": "Website",
    "description": "DESCRIPTION:",
    "projInfo": "PROJECT INFO:",
    "category": "Category",
    "date": "Date",
    "name": "Name",
    "web": "Web",
    "developed": "Developed by:"
  },
  "iBookShelf": {
    "slogan": "iBookShelf is the ideal place to access your favorite books and those you are about to discover.",
    "description1": "iBookShelf has multiple robust and versatile filtering features that allow you to navigate our extensive book collection efficiently and personally. With our filtering options, you'll easily find your next favorite read.",

    "title1": "Advanced Features",
    "bullet1": "iBookShelf offers multiple robust and versatile filtering features to explore our wide collection of books.",

    "title2": "Efficient and Personalized Navigation",
    "bullet2": "The filtering options allow you to easily find your next favorite read.",

    "title3": "State and Category Management",
    "bullet3": "We face the challenge of managing different states and categories of books for a smooth and responsive user experience.",

    "title4": "Personalization and Flexibility",
    "bullet4": "Allows you to build your own library according to your preferences and manage your reading activities efficiently.",
    "category": "Web Development"
  },
  "kuziFund": {
    "slogan": "Crowdfunding platform to support social causes, innovative businesses, and generate positive impact.",
    "description1": "Designed to support various types of campaigns, allowing people to voluntarily contribute to projects they are passionate about. The platform manages three main types of campaigns: for Entrepreneurs, Shelters and Foundations, and Social Impact.",

    "title1": "Campaign Visualization and Transparency",
    "bullet1": "Users can view campaigns with clear details about donations, including options to donate publicly or anonymously.",

    "title2": "Public or Anonymous Donations",
    "bullet2": "Users can choose between public or anonymous donations, respecting their privacy.",

    "title3": "User Management and Filtering",
    "bullet3": "The platform includes tools for efficient user management and the ability to filter campaigns according to interests.",

    "title4": "Payment Gateway Integration",
    "bullet4": "The platform securely handles transactions through payment gateways, ensuring a smooth and reliable donation process.",

    "title5": "Firebase Database",
    "bullet5": "Uses Firebase for real-time data management, ensuring security and constant availability.",
    "category": "Web Development"
  },
  "Weather": {
    "slogan": "Offers real-time weather data, personalized based on the user's location and time.",
    "description1": "Weather App is an intuitive and comprehensive weather application that keeps you always informed about weather conditions. Access accurate and detailed forecasts directly from the comfort of your smartphone or tablet.",

    "title1": "Instant Access",
    "bullet1": "Weather App offers immediate access to a wide variety of weather information.",

    "title2": "Exceptional User Experience",
    "bullet2": "Focuses on providing a smooth and high-quality user experience.",

    "title3": "Location-Based State Management",
    "bullet3": "Managing different weather conditions by location is a key challenge.",

    "title4": "Ease of Access",
    "bullet4": "Aims to simplify access to weather details, making the user experience easier.",

    "title5": "Flexibility and Customization",
    "bullet5": "Prioritizes customization and flexibility so users can adjust the app according to their individual preferences and needs.",
    "category": "Mobile Application"
  },
  "Memory": {
    "slogan": "Accept the challenge and tell me how many moves it will take you to solve it!",
    "description1": "The memory game is an exciting and challenging mental exercise that tests your ability to remember patterns and details accurately.",
    "title1": "State Management",
    "bullet1": "I implemented precise state management to effectively synchronize each user action.",

    "title2": "Responsive Design",
    "bullet2": "I created a responsive design to ensure the game is accessible and enjoyable on different devices.",

    "title3": "Synchronized Game Logic",
    "bullet3": "I incorporated efficient game logic, ensuring that each user event is correctly synchronized.",

    "title4": "Card and Statistics Visualization",
    "bullet4": "The game automatically displays matching cards, the number of moves, and the total time needed to solve it.",

    "category": "Web Development"
  },
  "TaskBoard": {
    "slogan": "Imagine a platform designed to simplify and organize your daily life efficiently.",
    "description1": "Task Board is a highly intuitive and flexible tool that allows you to manage your pending, in-progress, and completed activities in an organized and effective manner.",

    "title1": "Effective Task Management",
    "bullet1": "Task Board is an intuitive and flexible tool for organizing pending, in-progress, and completed activities effectively.",

    "title2": "Technical and Design Challenges",
    "bullet2": "The web application presents challenges that allow you to enhance your frontend development skills.",

    "title3": "Complex State Management",
    "bullet3": "Manages complex states for each card and the columns they reside in, ensuring correct functionality.",

    "title4": "Optimized User Experience",
    "bullet4": "Provides a smooth user experience with a responsive drag-and-drop feature.",

    "title5": "Customization and Flexibility",
    "bullet5": "Offers options to customize cards and manage activities according to your preferences.",

    "category": "Web Application"
  },

  "Pokedex": {
    "slogan": "Explore the exciting world of Pokémon and learn more about your favorite Pokémon!",
    "description1": "Every Pokémon Trainer has their special companion, their favorite Pokémon that has accompanied them on countless adventures. That's why we've created an exceptional tool that allows you to find your favorite Pokémon and explore all its features and evolutions in detail.",

    "title1": "Customized Search",
    "bullet1": "We have incorporated a special feature that allows you to easily find your favorite Pokémon.",

    "title2": "Detailed Descriptions",
    "bullet2": "Listen to all the details of any Pokémon, whether it's Pikachu, Charizard, Eevee, or any other.",

    "title3": "Sound Playback",
    "bullet3": "The Pokédex plays sounds that describe each Pokémon, enriching the user experience.",

    "title4": "Attractive CSS Animations",
    "bullet4": "Enjoy smooth and attractive CSS animations that enhance the display of your favorite Pokémon.",

    "category": "Web Application"
  },
  "GitHub": {
    "slogan": "A GitHub clone that gives you the ability to browse profiles and repositories.",
    "description1": "In our development platform, we understand that every developer has unique needs when managing and collaborating on source code projects.",

    "title1": "Recognition of Unique Needs",
    "bullet1": "Our platform understands that every developer has specific requirements when managing and collaborating on source code projects.",

    "title2": "Comprehensive Filtering Function",
    "bullet2": "We have implemented an advanced and versatile filtering function to facilitate the navigation and search of repositories and projects.",

    "title3": "Personalized Experience",
    "bullet3": "We offer filtering options that allow you to tailor the experience to your individual needs.",

    "title4": "Efficient Search",
    "bullet4": "Use our powerful search bar to quickly locate any repository or user.",

    "category": "Web Application"
  },
  "GameStore": {
    "slogan": "Provides details on games, available platforms, and filtering via RESTful APIs.",
    "description1": "We understand that every gamer has unique tastes and preferences. That's why we've developed a comprehensive and versatile filtering function that allows you to browse and find your ideal games efficiently. With our filtering options, customize your gaming experience according to your desires.",

    "title1": "Recognition of Unique Preferences",
    "bullet1": "We understand that every gamer has individual tastes and preferences.",

    "title2": "Advanced Filtering Function",
    "bullet2": "We have developed a comprehensive and versatile filtering tool to facilitate the search for ideal games.",

    "title3": "Experience Customization",
    "bullet3": "Adjust your gaming experience according to your desires with our filtering options.",

    "title4": "Genre Filtering",
    "bullet4": "Find games categorized into genres like action, adventure, role-playing, strategy, sports, simulation, and more that match your style.",

    "category": "Web Development"
  },
  "Contact": {
    "info": "CONTACT INFO",
    "mail": "Mail",
    "location": "LOCATION",
    "social": "SOCIAL INFO",
    "formName": "Name",
    "formEmail": "Email",
    "formSubject": "Your Subject",
    "formMessage": "Your Message",
    "formButton": "Send Message",
    "formSucces": "Your message was sent successfully"
  }
}
